snuplan/app/controllers/events_controller.rb

SELECT "tags".* FROM "tags"
---
  def main #메인페이지
    @tags = Tag.all

SELECT "events".* FROM "events" WHERE "events"."date" BETWEEN ? AND ?  [["date", "2019-05-31 15:00:00"], ["date", "2019-06-30 14:59:59.999999"]]
---
  def fullpage
    @this_month = Time.now.month
    #month_events = Event.where(title: "두번쨰 행사")
    t = Time.now
    @month_range = t.beginning_of_month..t.end_of_month
    @month_events = Event.where(:date => @month_range)

SELECT "events".* FROM "events"
SELECT  "tags".* FROM "tags" ORDER BY "tags"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "events".* FROM "events" INNER JOIN "events_tags" ON "events"."id" = "events_tags"."event_id" WHERE "events_tags"."tag_id" = ?  [["tag_id", 9]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events" INNER JOIN "events_tags" ON "events"."id" = "events_tags"."event_id" WHERE "events_tags"."tag_id" = ?  [["tag_id", 1]]
---
  def index #검색된 페이지. 태그에 맞는것들만 불러오기

   @a = Array.new
 # 태그검색 함수!! strong params만 추가하면 된다!!
 if params[:tag] == nil
  @a = Event.all
else
  params[:tag].each do |f|
   Tag.find_by_id(f).events.each do |d|
    @a.push(d)
  end

end
end

##테스트중
@tags = Tag.all
@s = Array.new

#if params[:id]
# respond_to do |format|
 #   format.js { render partial: 'show'}
 # end
 # @event = Event.find(params[:id])
 if params[:search]
  params[:search].each do |f|
   Tag.find_by_id(f).events.each do |d|

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show # 상세페이지.. 현재 무한루프에 빠지는 상태 ㅠㅠ 파일 이름 탓인거 같은데 ;;;

  	@event = Event.find(params[:id])

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def selected_tags
      params[:tag].each do |t|
       @t = Tag.find_by(:id => "#{t}")