snuplan/app/controllers/my_pages_controller.rb

SELECT "tags".* FROM "tags"
---
  def new # 게시물 올리는 페이지
  	@event = Event.new # db 안넣은 빈 모델
  	@year = Time.now.year
  	@tags = Tag.all

INSERT INTO "events" ("title", "date", "location", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", ""], ["date", "2019-10-04 00:00:00"], ["location", ""], ["text", ""], ["created_at", "2019-06-04 10:30:37.214754"], ["updated_at", "2019-06-04 10:30:37.214754"]]
---
  def create # new 액션의 post request
  	@event = Event.new(event_params)
  	if @event.save #model validation 통과해서 만들어치면 true